msemegen/CML/lib/soc/stm32l4/mcu.cpp
/*
 *   Name: mcu.cpp
 *
 *   Copyright (c) Mateusz Semegen and contributors. All rights reserved.
 *   Licensed under the MIT license. See LICENSE file in the project root for details.
 */

#ifdef STM32L4

// this
#include <soc/stm32l4/mcu.hpp>

// cml
#include <cml/bit.hpp>
#include <cml/debug/assertion.hpp>
#include <cml/utils/wait_until.hpp>

namespace {

using namespace cml;
using namespace soc::stm32l4;

#if defined(STM32L412xx) || defined(STM32L422xx) || defined(STM32L431xx) || defined(STM32L432xx) || \
    defined(STM32L433xx) || defined(STM32L442xx) || defined(STM32L443xx) || defined(STM32L451xx) || \
    defined(STM32L452xx) || defined(STM32L462xx)

constexpr uint32_t msi_frequency_hz_lut[] { 100u * 1000u,   200u * 1000u,   400u * 1000u,   800u * 1000u,
                                            1u * 1000000u,  2u * 1000000u,  4u * 1000000u,  8u * 1000000u,
                                            16u * 1000000u, 24u * 1000000u, 32u * 1000000u, 48u * 1000000u };

mcu::Sysclk_frequency_change_callback pre_sysclk_frequency_change_callback;
mcu::Sysclk_frequency_change_callback post_sysclk_frequency_change_callback;

template<typename Config_t>
uint32_t get_pll_register_config_from_factor(const Config_t& a_config, uint32_t a_enable_flag)
{
    return (static_cast<uint32_t>(a_config.divider) |
            (mcu::Pll_config::Output::enabled == a_config.output ? a_enable_flag : 0));
}

#endif

} // namespace

namespace soc {
namespace stm32l4 {

#if defined(STM32L412xx) || defined(STM32L422xx) || defined(STM32L431xx) || defined(STM32L432xx) || \
    defined(STM32L433xx) || defined(STM32L442xx) || defined(STM32L443xx) || defined(STM32L451xx) || \
    defined(STM32L452xx) || defined(STM32L462xx)

using namespace cml;
using namespace cml::utils;

void mcu::enable_msi_clock(Msi_frequency a_freq)
{
    bit_flag::clear(&(RCC->CR), RCC_CR_MSION);

    bit_flag::set(&(RCC->CR), RCC_CR_MSIRANGE, static_cast<uint32_t>(a_freq) << RCC_CR_MSIRANGE_Pos);

    bit_flag::set(&(RCC->CR), RCC_CR_MSION);

    wait_until::all_bits(&(RCC->CR), RCC_CR_MSIRDY, false);

    bit_flag::clear(&(RCC->ICSCR), RCC_ICSCR_MSITRIM);
    bit_flag::set(&(RCC->CR), RCC_CR_MSIRGSEL);

    wait_until::all_bits(&(RCC->CR), RCC_CR_MSIRDY, false);
}

void mcu::enable_hsi_clock(Hsi_frequency)
{
    bit_flag::set(&(RCC->CR), RCC_CR_HSION, RCC_CR_HSION);

    wait_until::all_bits(&(RCC->CR), RCC_CR_HSIRDY, false);
}

void mcu::enable_lsi_clock(Lsi_frequency)
{
    bit_flag::set(&(RCC->CSR), RCC_CSR_LSION, RCC_CSR_LSION);

    wait_until::all_bits(&(RCC->CSR), RCC_CSR_LSIRDY, false);
}

void mcu::enable_hsi48_clock(Hsi48_frequency)
{
    bit_flag::set(&(RCC->CRRCR), RCC_CRRCR_HSI48ON);

    wait_until::all_bits(&(RCC->CRRCR), RCC_CRRCR_HSI48ON, false);
}

void mcu::disable_msi_clock()
{
    bit_flag::clear(&(RCC->CR), RCC_CR_MSION);

    wait_until::all_bits(&(RCC->CR), RCC_CR_MSIRDY, true);
}

void mcu::disable_hsi_clock()
{
    bit_flag::clear(&(RCC->CR), RCC_CR_HSION);

    wait_until::all_bits(&(RCC->CR), RCC_CR_HSIRDY, true);
}

void mcu::disable_lsi_clock()
{
    bit_flag::clear(&(RCC->CSR), RCC_CSR_LSION);

    wait_until::all_bits(&(RCC->CSR), RCC_CSR_LSIRDY, true);
}

void mcu::disable_hsi48_clock()
{
    bit_flag::clear(&(RCC->CRRCR), RCC_CRRCR_HSI48ON);

    wait_until::all_bits(&(RCC->CRRCR), RCC_CRRCR_HSI48ON, true);
}

void mcu::enable_pll(const Pll_config& a_config)
{
    cml_assert(a_config.source != static_cast<Pll_config::Source>(static_cast<uint32_t>(Pll_config::Source::hsi) + 1));
    cml_assert(a_config.m != static_cast<Pll_config::M>(static_cast<uint32_t>(Pll_config::M::_8) + 1));

    cml_assert(a_config.pll.r.divider !=
               static_cast<Pll_config::PLL::R::Divider>(static_cast<uint32_t>(Pll_config::PLL::R::Divider::_8) + 1));
    cml_assert(a_config.pll.r.output !=
               static_cast<Pll_config::Output>(static_cast<uint32_t>(Pll_config::Output::enabled) + 1));

    cml_assert(a_config.pll.q.divider !=
               static_cast<Pll_config::PLL::Q::Divider>(static_cast<uint32_t>(Pll_config::PLL::Q::Divider::_8) + 1));
    cml_assert(a_config.pll.q.output !=
               static_cast<Pll_config::Output>(static_cast<uint32_t>(Pll_config::Output::enabled) + 1));

#if defined(STM32L431xx) || defined(STM32L432xx) || defined(STM32L433xx) || defined(STM32L442xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
    cml_assert(a_config.pll.p.divider !=
               static_cast<Pll_config::PLL::P::Divider>(static_cast<uint32_t>(Pll_config::PLL::P::Divider::_17) + 1));
    cml_assert(a_config.pll.p.output !=
               static_cast<Pll_config::Output>(static_cast<uint32_t>(Pll_config::Output::enabled) + 1));
#endif

#if defined(STM32L431xx) || defined(STM32L432xx) || defined(STM32L433xx) || defined(STM32L442xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
    cml_assert(a_config.pllsai1.r.divider != static_cast<Pll_config::PLLSAI1::R::Divider>(
                                                 static_cast<uint32_t>(Pll_config::PLLSAI1::R::Divider::_8) + 1));
    cml_assert(a_config.pllsai1.r.output !=
               static_cast<Pll_config::Output>(static_cast<uint32_t>(Pll_config::Output::enabled) + 1));

    cml_assert(a_config.pllsai1.q.divider != static_cast<Pll_config::PLLSAI1::Q::Divider>(
                                                 static_cast<uint32_t>(Pll_config::PLLSAI1::Q::Divider::_8) + 1));
    cml_assert(a_config.pllsai1.q.output !=
               static_cast<Pll_config::Output>(static_cast<uint32_t>(Pll_config::Output::enabled) + 1));

    cml_assert(a_config.pllsai1.p.divider != static_cast<Pll_config::PLLSAI1::P::Divider>(
                                                 static_cast<uint32_t>(Pll_config::PLLSAI1::P::Divider::_17) + 1));
    cml_assert(a_config.pllsai1.p.output !=
               static_cast<Pll_config::Output>(static_cast<uint32_t>(Pll_config::Output::enabled) + 1));
#endif

    cml_assert((true == is_clock_enabled(Clock::msi) && a_config.source == Pll_config::Source::msi) ||
               (true == is_clock_enabled(Clock::hsi) && a_config.source == Pll_config::Source::hsi));
    cml_assert((a_config.pll.n >= 8 && a_config.pll.n <= 86));
#if defined(STM32L431xx) || defined(STM32L432xx) || defined(STM32L433xx) || defined(STM32L442xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
    cml_assert(a_config.pllsai1.n >= 8 && a_config.pllsai1.n <= 86);
#endif

    disable_pll();

