msemegen/CML/lib/soc/stm32l4/mcu.cpp
    return 0;
}

internal_flash::Latency mcu::select_flash_latency(uint32_t a_syclk_freq, Voltage_scaling a_voltage_scaling)
{
    switch (a_voltage_scaling)
    {
        case Voltage_scaling::_1: {
            if (a_syclk_freq <= 16u * 1000000u)
            {
                return internal_flash::Latency::_0;
            }

            if (a_syclk_freq <= 32u * 1000000u)
            {
                return internal_flash::Latency::_1;
            }

            if (a_syclk_freq <= 48u * 1000000u)
            {
                return internal_flash::Latency::_2;
            }

            if (a_syclk_freq <= 64u * 1000000u)
            {
                return internal_flash::Latency::_3;
            }
        }
        break;

        case Voltage_scaling::_2: {
            if (a_syclk_freq <= 6u * 1000000u)
            {
                return internal_flash::Latency::_0;
            }

            if (a_syclk_freq <= 12u * 1000000u)
            {
                return internal_flash::Latency::_1;
            }

            if (a_syclk_freq <= 18u * 1000000u)
            {
                return internal_flash::Latency::_2;
            }

            if (a_syclk_freq <= 26u * 1000000u)
            {
                return internal_flash::Latency::_3;
            }
        }
        break;
    }

    return internal_flash::Latency::_4;
}

mcu::Voltage_scaling mcu::select_voltage_scaling(Sysclk_source a_source, uint32_t a_sysclk_freq)
{
    if ((Sysclk_source::msi == a_source && a_sysclk_freq <= 24 * 1000000u) ||
        (Sysclk_source::pll == a_source && a_sysclk_freq <= 26 * 1000000u))
    {
        return Voltage_scaling::_2;
    }

    return Voltage_scaling::_1;
}

void mcu::set_flash_latency(internal_flash::Latency a_latency)
{
    bit_flag::set(&(FLASH->ACR), FLASH_ACR_LATENCY, static_cast<uint32_t>(a_latency));

    while (false == bit_flag::is(FLASH->ACR, static_cast<uint32_t>(a_latency)))
        ;
}

void mcu::set_voltage_scaling(Voltage_scaling a_scaling)
{
    bit_flag::set(&(PWR->CR1), PWR_CR1_VOS, static_cast<uint32_t>(a_scaling));

    while (true == bit::is(PWR->SR2, PWR_SR2_VOSF_Pos))
        ;
}

void mcu::set_sysclk_source(Sysclk_source a_sysclk_source)
{
    bit_flag::set(&(RCC->CFGR), RCC_CFGR_SW, static_cast<uint32_t>(a_sysclk_source));
    while (false == bit_flag::is(RCC->CFGR, static_cast<uint32_t>(a_sysclk_source) << RCC_CFGR_SWS_Pos))
        ;
}

void mcu::set_bus_prescalers(const Bus_prescalers& a_prescalers)
{
    cml_assert(static_cast<Bus_prescalers::AHB>(static_cast<uint32_t>(Bus_prescalers::AHB::_512) + 1) !=
               a_prescalers.ahb);
    cml_assert(static_cast<Bus_prescalers::APB1>(static_cast<uint32_t>(Bus_prescalers::APB1::_16) + 1) !=
               a_prescalers.apb1);
    cml_assert(static_cast<Bus_prescalers::APB2>(static_cast<uint32_t>(Bus_prescalers::APB2::_16) + 1) !=
               a_prescalers.apb2);

    bit_flag::set(&(RCC->CFGR), RCC_CFGR_HPRE, static_cast<uint32_t>(a_prescalers.ahb));
    bit_flag::set(&(RCC->CFGR), RCC_CFGR_PPRE1, static_cast<uint32_t>(a_prescalers.apb1));
    bit_flag::set(&(RCC->CFGR), RCC_CFGR_PPRE2, static_cast<uint32_t>(a_prescalers.apb2));
}

void mcu::increase_sysclk_frequency(Sysclk_source a_source,
                                    uint32_t a_frequency_hz,
                                    const Bus_prescalers& a_prescalers,
                                    Voltage_scaling a_voltage_scaling)
{
    cml_assert(a_voltage_scaling == Voltage_scaling::_2 &&
               ((get_sysclk_source() == Sysclk_source::msi && a_frequency_hz <= 24u * 1000000u) ||
                (get_sysclk_source() == Sysclk_source::pll && a_frequency_hz <= 26 * 1000000u)));

    auto new_voltage_scaling = select_voltage_scaling(a_source, a_frequency_hz);
    auto new_flash_latency   = select_flash_latency(a_frequency_hz, new_voltage_scaling);

    if (a_voltage_scaling != get_voltage_scaling())
    {
        set_voltage_scaling(a_voltage_scaling);
    }

    if (new_flash_latency != internal_flash::get_latency())
    {
        set_flash_latency(new_flash_latency);
    }

    set_sysclk_source(a_source);
    set_bus_prescalers(a_prescalers);

    SystemCoreClock = a_frequency_hz;
}

void mcu::decrease_sysclk_frequency(Sysclk_source a_source,
                                    uint32_t a_frequency_hz,
                                    const Bus_prescalers& a_prescalers,
                                    Voltage_scaling a_voltage_scaling)
{
    cml_assert(a_voltage_scaling == Voltage_scaling::_2 &&
               ((get_sysclk_source() == Sysclk_source::msi && a_frequency_hz <= 24u * 1000000u) ||
                (get_sysclk_source() == Sysclk_source::pll && a_frequency_hz <= 26 * 1000000u)));

    set_sysclk_source(a_source);

    auto new_voltage_scaling = select_voltage_scaling(a_source, a_frequency_hz);
    auto new_flash_latency   = select_flash_latency(a_frequency_hz, new_voltage_scaling);

    if (new_flash_latency != internal_flash::get_latency())
    {
        set_flash_latency(new_flash_latency);
    }

    if (a_voltage_scaling != get_voltage_scaling())
    {
        set_voltage_scaling(a_voltage_scaling);
    }

    set_bus_prescalers(a_prescalers);

    SystemCoreClock = a_frequency_hz;
}

uint32_t mcu::calculate_pll_r_output_frequency()
{
    const uint32_t m =
        (static_cast<uint32_t>(bit_flag::get(RCC->PLLCFGR, RCC_PLLCFGR_PLLM)) >> RCC_PLLCFGR_PLLM_Pos) + 1u;
    const uint32_t n = (static_cast<uint32_t>(bit_flag::get(RCC->PLLCFGR, RCC_PLLCFGR_PLLN)) >> RCC_PLLCFGR_PLLN_Pos);

    uint32_t pllvco = 0;

    switch (static_cast<Pll_config::Source>(bit_flag::get(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC)))
    {
        case Pll_config::Source::msi: {
            uint32_t msi_range = bit_flag::get(RCC->CR, RCC_CR_MSIRANGE) >> RCC_CR_MSIRANGE_Pos;
            pllvco             = (msi_frequency_hz_lut[msi_range] / m) * n;
        }
        break;

        case Pll_config::Source::hsi: {
            pllvco = (get_hsi_frequency_hz() / m) * n;
        }
        break;
    }

    cml_assert(pllvco >= 96 * 1000000u && pllvco <= 344 * 1000000u);

    uint32_t pllr = ((bit_flag::get(RCC->PLLCFGR, RCC_PLLCFGR_PLLR) >> RCC_PLLCFGR_PLLR_Pos) + 1u) * 2u;
    return pllvco / pllr;
}

uint32_t mcu::calculate_pll_q_output_frequency()
{
    const uint32_t m = (bit_flag::get(RCC->PLLCFGR, RCC_PLLCFGR_PLLM) >> RCC_PLLCFGR_PLLM_Pos) + 1u;
    const uint32_t n = bit_flag::get(RCC->PLLCFGR, RCC_PLLCFGR_PLLN) >> RCC_PLLCFGR_PLLN_Pos;
    const uint32_t q = ((bit_flag::get(RCC->PLLCFGR, RCC_PLLCFGR_PLLQ) >> RCC_PLLCFGR_PLLQ_Pos) * 2u) + 2u;

    switch (static_cast<Pll_config::Source>(bit_flag::get(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC)))
    {
        case Pll_config::Source::msi: {
            const uint32_t msi_range = bit_flag::get(RCC->CR, RCC_CR_MSIRANGE) >> RCC_CR_MSIRANGE_Pos;
            return ((msi_frequency_hz_lut[msi_range] / m) * n) / q;
        }

        case Pll_config::Source::hsi: {
            return ((get_hsi_frequency_hz() / m) * n) / q;
        }
    }

    return 0;
}

#if defined(STM32L431xx) || defined(STM32L432xx) || defined(STM32L433xx) || defined(STM32L442xx) || \
    defined(STM32L443xx) || defined(STM32L451xx) || defined(STM32L452xx) || defined(STM32L462xx)
uint32_t mcu::calculate_pllsai1_q_output_frequency()
{
    const uint32_t m = (bit_flag::get(RCC->PLLCFGR, RCC_PLLCFGR_PLLM) >> RCC_PLLCFGR_PLLM_Pos) + 1u;
    const uint32_t n = (bit_flag::get(RCC->PLLSAI1CFGR, RCC_PLLSAI1CFGR_PLLSAI1N) >> RCC_PLLSAI1CFGR_PLLSAI1N_Pos) + 1u;
    const uint32_t q =
        ((bit_flag::get(RCC->PLLCFGR, RCC_PLLSAI1CFGR_PLLSAI1Q) >> RCC_PLLSAI1CFGR_PLLSAI1Q_Pos) * 2u) + 2u;

    switch (static_cast<Pll_config::Source>(bit_flag::get(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC)))
    {
        case Pll_config::Source::msi: {
            uint32_t msi_range = bit_flag::get(RCC->CR, RCC_CR_MSIRANGE) >> RCC_CR_MSIRANGE_Pos;
            return ((msi_frequency_hz_lut[msi_range] / m) * n) / q;
        }

        case Pll_config::Source::hsi: {
            return ((get_hsi_frequency_hz() / m) * n) / q;
        }

        default: {
            cml_assert(false);
            return 0;
        }
    }

    return 0;
}
#endif

#endif

} // namespace stm32l4
} // namespace soc

#endif // STM32L4xx